linkedin-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/linkedin/getAccessToken.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.linkedin.getaccesstoken">
   <soapenv:Header/> 
   <soapenv:Body>
     <urn:grantType>authorization_code</urn:grantType> 
     <urn:appUri>http://api.linkedin.com</urn:appUri>
     <urn:code>AQTAheamE2EQZb7sED1g6zMvuttb_Fq0nhquvZwxcot59QKuVX_w1p8uqT82702vcOS5gMqzu794Bit6jmSyCriKc6BmZW4geCoIKyy8X7uZ03EH9sc</urn:code> 
     <urn:redirectUri>http://www.google.com</urn:redirectUri> 
     <urn:clientId>754ycdhhyuhj9z</urn:clientId> 
     <urn:clientSecret>ttm3p4Wei3YGPkoT</urn:clientSecret> 
   </soapenv:Body>
</soapenv:Envelope>
